/*
 * [문제]
 * 1차원 배열에 저장된 점수만큼 네모를 출력하시오.
 * ex) 90점은 네모 9개 -> ■■■■■■■■■
 * 		int jumsu[] = {90, 80, 50, 70, 65, 90, 100, 43, 55, 87};
 * 
 * [출력 형태]
 * 90 점 : ■ ■ ■ ■ ■ ■ ■ ■ ■
 * 80 점 : ■ ■ ■ ■ ■ ■ ■ ■
 * 50 점 : ■ ■ ■ ■ ■
 * 70 점 : ■ ■ ■ ■ ■ ■ ■
 * 65 점 : ■ ■ ■ ■ ■ ■
 * 90 점 : ■ ■ ■ ■ ■ ■ ■ ■ ■
 * 100 점 : ■ ■ ■ ■ ■ ■ ■ ■ ■ ■
 * 43 점 : ■ ■ ■ ■
 * 55 점 : ■ ■ ■ ■ ■
 * 87 점 : ■ ■ ■ ■ ■ ■ ■ ■
 */

public class P2 {

	public static void main(String[] args) {

		int jumsu[] = {90, 80, 50, 70, 65, 90, 100, 43, 55, 87};
		
		for(int i: jumsu) {
			System.out.print(i + " 점 : ");
			
			for(int j=0; j<i/10; j++) {
				System.out.print("■ ");
			}
			
			System.out.println();
		}
	}

}
